loadtest/results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6-script.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m20s max duration (incl. graceful stop):
              * read_traffic: Up to 20 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
read_traffic   [   2% ] 01/20 VUs  00.9s/50.0s

running (0m02.0s), 03/20 VUs, 1 complete and 0 interrupted iterations
read_traffic   [   4% ] 03/20 VUs  01.9s/50.0s

running (0m03.0s), 05/20 VUs, 4 complete and 0 interrupted iterations
read_traffic   [   6% ] 05/20 VUs  02.9s/50.0s

running (0m04.0s), 07/20 VUs, 9 complete and 0 interrupted iterations
read_traffic   [   8% ] 07/20 VUs  03.9s/50.0s

running (0m05.0s), 09/20 VUs, 16 complete and 0 interrupted iterations
read_traffic   [  10% ] 09/20 VUs  04.9s/50.0s

running (0m06.0s), 11/20 VUs, 25 complete and 0 interrupted iterations
read_traffic   [  12% ] 11/20 VUs  05.9s/50.0s

running (0m07.0s), 13/20 VUs, 36 complete and 0 interrupted iterations
read_traffic   [  14% ] 13/20 VUs  06.9s/50.0s

running (0m08.0s), 15/20 VUs, 49 complete and 0 interrupted iterations
read_traffic   [  16% ] 15/20 VUs  07.9s/50.0s

running (0m09.0s), 17/20 VUs, 64 complete and 0 interrupted iterations
read_traffic   [  18% ] 17/20 VUs  08.9s/50.0s

running (0m10.0s), 19/20 VUs, 81 complete and 0 interrupted iterations
read_traffic   [  20% ] 19/20 VUs  09.9s/50.0s

running (0m11.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
read_traffic   [  22% ] 20/20 VUs  10.9s/50.0s

running (0m12.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
read_traffic   [  24% ] 20/20 VUs  11.9s/50.0s

running (0m13.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
read_traffic   [  26% ] 20/20 VUs  12.9s/50.0s

running (0m14.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
read_traffic   [  28% ] 20/20 VUs  13.9s/50.0s

running (0m15.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
read_traffic   [  30% ] 20/20 VUs  14.9s/50.0s

running (0m16.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
read_traffic   [  32% ] 20/20 VUs  15.9s/50.0s

running (0m17.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
read_traffic   [  34% ] 20/20 VUs  16.9s/50.0s

running (0m18.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
read_traffic   [  36% ] 20/20 VUs  17.9s/50.0s

running (0m19.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
read_traffic   [  38% ] 20/20 VUs  18.9s/50.0s

running (0m20.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
read_traffic   [  40% ] 20/20 VUs  19.9s/50.0s

running (0m21.0s), 20/20 VUs, 299 complete and 0 interrupted iterations
read_traffic   [  42% ] 20/20 VUs  20.9s/50.0s

running (0m22.0s), 20/20 VUs, 318 complete and 0 interrupted iterations
read_traffic   [  44% ] 20/20 VUs  21.9s/50.0s

running (0m23.0s), 20/20 VUs, 338 complete and 0 interrupted iterations
read_traffic   [  46% ] 20/20 VUs  22.9s/50.0s

running (0m24.0s), 20/20 VUs, 357 complete and 0 interrupted iterations
read_traffic   [  48% ] 20/20 VUs  23.9s/50.0s

running (0m25.0s), 20/20 VUs, 377 complete and 0 interrupted iterations
read_traffic   [  50% ] 20/20 VUs  24.9s/50.0s

running (0m26.0s), 20/20 VUs, 397 complete and 0 interrupted iterations
read_traffic   [  52% ] 20/20 VUs  25.9s/50.0s

running (0m27.0s), 20/20 VUs, 417 complete and 0 interrupted iterations
read_traffic   [  54% ] 20/20 VUs  26.9s/50.0s

running (0m28.0s), 20/20 VUs, 433 complete and 0 interrupted iterations
read_traffic   [  56% ] 20/20 VUs  27.9s/50.0s

running (0m29.0s), 20/20 VUs, 452 complete and 0 interrupted iterations
read_traffic   [  58% ] 20/20 VUs  28.9s/50.0s

running (0m30.0s), 20/20 VUs, 472 complete and 0 interrupted iterations
read_traffic   [  60% ] 20/20 VUs  29.9s/50.0s

running (0m31.0s), 20/20 VUs, 492 complete and 0 interrupted iterations
read_traffic   [  62% ] 20/20 VUs  30.9s/50.0s

running (0m32.0s), 20/20 VUs, 511 complete and 0 interrupted iterations
read_traffic   [  64% ] 20/20 VUs  31.9s/50.0s

running (0m33.0s), 20/20 VUs, 531 complete and 0 interrupted iterations
read_traffic   [  66% ] 20/20 VUs  32.9s/50.0s

running (0m34.0s), 20/20 VUs, 550 complete and 0 interrupted iterations
read_traffic   [  68% ] 20/20 VUs  33.9s/50.0s

running (0m35.0s), 20/20 VUs, 570 complete and 0 interrupted iterations
read_traffic   [  70% ] 20/20 VUs  34.9s/50.0s

running (0m36.0s), 20/20 VUs, 590 complete and 0 interrupted iterations
read_traffic   [  72% ] 20/20 VUs  35.9s/50.0s

running (0m37.0s), 20/20 VUs, 610 complete and 0 interrupted iterations
read_traffic   [  74% ] 20/20 VUs  36.9s/50.0s

running (0m38.0s), 20/20 VUs, 630 complete and 0 interrupted iterations
read_traffic   [  76% ] 20/20 VUs  37.9s/50.0s

running (0m39.0s), 20/20 VUs, 650 complete and 0 interrupted iterations
read_traffic   [  78% ] 20/20 VUs  38.9s/50.0s

running (0m40.0s), 20/20 VUs, 670 complete and 0 interrupted iterations
read_traffic   [  80% ] 20/20 VUs  39.9s/50.0s

running (0m41.0s), 19/20 VUs, 690 complete and 0 interrupted iterations
read_traffic   [  82% ] 19/20 VUs  40.9s/50.0s

running (0m42.0s), 17/20 VUs, 709 complete and 0 interrupted iterations
read_traffic   [  84% ] 17/20 VUs  41.9s/50.0s

running (0m43.0s), 15/20 VUs, 726 complete and 0 interrupted iterations
read_traffic   [  86% ] 15/20 VUs  42.9s/50.0s

running (0m44.0s), 13/20 VUs, 741 complete and 0 interrupted iterations
read_traffic   [  88% ] 13/20 VUs  43.9s/50.0s

running (0m45.0s), 11/20 VUs, 754 complete and 0 interrupted iterations
read_traffic   [  90% ] 11/20 VUs  44.9s/50.0s

running (0m46.0s), 09/20 VUs, 765 complete and 0 interrupted iterations
read_traffic   [  92% ] 09/20 VUs  45.9s/50.0s

running (0m47.0s), 07/20 VUs, 774 complete and 0 interrupted iterations
read_traffic   [  94% ] 07/20 VUs  46.9s/50.0s

running (0m48.0s), 05/20 VUs, 781 complete and 0 interrupted iterations
read_traffic   [  96% ] 05/20 VUs  47.9s/50.0s

running (0m49.0s), 03/20 VUs, 786 complete and 0 interrupted iterations
read_traffic   [  98% ] 03/20 VUs  48.9s/50.0s

running (0m50.0s), 01/20 VUs, 789 complete and 0 interrupted iterations
read_traffic   [ 100% ] 01/20 VUs  49.9s/50.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=27.16ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3950    78.223303/s
    checks_succeeded...: 100.00% 3950 out of 3950
    checks_failed......: 0.00%   0 out of 3950

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=11.96ms min=1.82ms med=9.92ms max=89.31ms p(90)=20.88ms p(95)=27.16ms
      { expected_response:true }...: avg=11.96ms min=1.82ms med=9.92ms max=89.31ms p(90)=20.88ms p(95)=27.16ms
    http_req_failed................: 0.00%  0 out of 3952
    http_reqs......................: 3952   78.26291/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1s     med=1.01s  max=1.07s   p(90)=1.02s   p(95)=1.03s  
    iterations.....................: 790    15.644661/s
    vus............................: 1      min=1         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 5.2 MB 103 kB/s
    data_sent......................: 2.6 MB 51 kB/s



running (0m50.5s), 00/20 VUs, 790 complete and 0 interrupted iterations
read_traffic ✓ [ 100% ] 00/20 VUs  50s